ZeroZap/XinYi/boards/pandora_stm32l475/main.c
#include "stm32l4xx_hal.h"
#include "pandora_fota_flash.h"
#include "pandora_soft_i2c.h"
#include "xy_device.h"
#include "xy_sys.h"

static UART_HandleTypeDef uart1;


#ifndef XINYI_FIRMWARE_COMMIT
#error "XINYI_FIRMWARE_COMMIT must identify the source commit used for this image"
#endif

void _init(void) {}
void _fini(void) {}

void SysTick_Handler(void)
{
    HAL_IncTick();
}

static void fail(void)
{
    __disable_irq();
    for (;;) {
    }
}

static void uart_hex32(uint32_t value)
{
    static const char digits[] = "0123456789ABCDEF";
    uint8_t text[8];

    for (uint32_t index = 0; index < sizeof(text); ++index) {
        uint32_t shift = (uint32_t)(sizeof(text) - 1U - index) * 4U;
        text[index] = (uint8_t)digits[(value >> shift) & 0x0FU];
    }
    HAL_UART_Transmit(&uart1, text, sizeof(text), 100U);
}

static int aht10_init(xy_i2c_device_t *device)
{
    static const uint8_t command[] = {0xE1U, 0x08U, 0x00U};
    HAL_Delay(40U);
    if (xy_i2c_device_write(device, command, sizeof(command)) != XY_DEVICE_OK) {
        return 0;
    }
    HAL_Delay(10U);
    return 1;
}

static int aht10_measure(xy_i2c_device_t *device, uint32_t *humidity_milli_percent,
                         int32_t *temperature_milli_c)
{
    static const uint8_t command[] = {0xACU, 0x33U, 0x00U};
    uint8_t data[6];
    if (xy_i2c_device_write(device, command, sizeof(command)) != XY_DEVICE_OK) {
        return 0;
    }
    HAL_Delay(80U);
    if (xy_i2c_device_read(device, data, sizeof(data)) != XY_DEVICE_OK ||
        (data[0] & 0x80U) != 0U) {
        return 0;
    }
    uint32_t raw_humidity = ((uint32_t)data[1] << 12) | ((uint32_t)data[2] << 4) |
                            ((uint32_t)data[3] >> 4);
    uint32_t raw_temperature = ((uint32_t)(data[3] & 0x0FU) << 16) |
                               ((uint32_t)data[4] << 8) | data[5];
    *humidity_milli_percent = (uint32_t)(((uint64_t)raw_humidity * 100000U) >> 20);
    *temperature_milli_c = (int32_t)(((uint64_t)raw_temperature * 200000U) >> 20) - 50000;
    return 1;
}

static void uart_text(const char *text)
{
    uint16_t length = 0;
    while (text[length] != '\0') ++length;
    HAL_UART_Transmit(&uart1, (uint8_t *)text, length, 100U);
}

static void uart_u32(uint32_t value)
{
    uint8_t digits[10];
    uint32_t count = 0;
    do {
        digits[count++] = (uint8_t)('0' + value % 10U);
        value /= 10U;
    } while (value != 0U);
    while (count != 0U) {
        --count;
        HAL_UART_Transmit(&uart1, &digits[count], 1U, 100U);
    }
}

static void uart_i32(int32_t value)
{
    if (value < 0) {
        uart_text("-");
        uart_u32((uint32_t)(-(int64_t)value));
    } else {
        uart_u32((uint32_t)value);
    }
}

static void clock_init(void)
{
    RCC_OscInitTypeDef osc = {0};
    RCC_ClkInitTypeDef clk = {0};

    __HAL_RCC_PWR_CLK_ENABLE();
    if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK) {
        fail();
    }
    osc.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    osc.HSEState = RCC_HSE_ON;
    osc.PLL.PLLState = RCC_PLL_ON;
    osc.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    osc.PLL.PLLM = 1;
    osc.PLL.PLLN = 20;
    osc.PLL.PLLP = RCC_PLLP_DIV7;
    osc.PLL.PLLQ = RCC_PLLQ_DIV2;
    osc.PLL.PLLR = RCC_PLLR_DIV2;
    if (HAL_RCC_OscConfig(&osc) != HAL_OK) {
        fail();
    }
    clk.ClockType = RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK |
                    RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    clk.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    clk.AHBCLKDivider = RCC_SYSCLK_DIV1;
    clk.APB1CLKDivider = RCC_HCLK_DIV1;
    clk.APB2CLKDivider = RCC_HCLK_DIV1;
    if (HAL_RCC_ClockConfig(&clk, FLASH_LATENCY_4) != HAL_OK) {
        fail();
    }
}

static void gpio_uart_init(void)
{
    GPIO_InitTypeDef gpio = {0};
    __HAL_RCC_GPIOE_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();

    __HAL_RCC_USART1_CLK_ENABLE();

    gpio.Pin = GPIO_PIN_7;
    gpio.Mode = GPIO_MODE_OUTPUT_PP;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOE, &gpio);

    gpio.Pin = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10; /* KEY2/KEY1/KEY0 */
    gpio.Mode = GPIO_MODE_INPUT;
    gpio.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(GPIOD, &gpio);


    gpio.Pin = GPIO_PIN_9 | GPIO_PIN_10;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_PULLUP;
    gpio.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio.Alternate = GPIO_AF7_USART1;
    HAL_GPIO_Init(GPIOA, &gpio);

    uart1.Instance = USART1;
    uart1.Init.BaudRate = 115200;
    uart1.Init.WordLength = UART_WORDLENGTH_8B;
    uart1.Init.StopBits = UART_STOPBITS_1;
    uart1.Init.Parity = UART_PARITY_NONE;
    uart1.Init.Mode = UART_MODE_TX_RX;
    uart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    uart1.Init.OverSampling = UART_OVERSAMPLING_16;
    uart1.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
    if (HAL_UART_Init(&uart1) != HAL_OK) {
        fail();
    }
}

int main(void)
{
    static const uint8_t banner[] = "PANDORA STM32L475VE XINYI SMOKE OK\r\n";
    static const uint8_t firmware_commit[] = "FIRMWARE_COMMIT " XINYI_FIRMWARE_COMMIT "\r\n";
    static const uint8_t key0[] = "KEY0\r\n";
    static const uint8_t aht_ack[] = "AHT10 0x38 ACK\r\n";
    static const uint8_t aht_nack[] = "AHT10 0x38 NACK\r\n";
    uint32_t humidity_milli_percent = 0;
    int32_t temperature_milli_c = 0;
    uint32_t reset_reason = 0;
    uint32_t chip_id[3] = {0};
    xy_i2c_device_t aht10 = {0};
    const xy_fota_metadata_flash_t *metadata_backend;
    xy_fota_metadata_t metadata = {
        .active_version = 1U,
        .min_version = 1U,
        .active_slot = 0U,
        .pending_slot = XY_FOTA_METADATA_NO_SLOT,
    };
    xy_fota_metadata_t committed;
    xy_fota_metadata_t loaded;

    HAL_Init();
    clock_init();
    gpio_uart_init();
    xy_sys_init();
    if (xy_sys_reboot_reason(&reset_reason) != XY_OK || xy_sys_get_chip_id(chip_id) != XY_OK) {
        fail();
    }
    uart_text("SYS_RESET_CSR 0x");
    uart_hex32(reset_reason);
    uart_text("\r\nSYS_CHIP_ID ");
    uart_hex32(chip_id[0]);
    uart_hex32(chip_id[1]);
    uart_hex32(chip_id[2]);
    uart_text("\r\n");
    if ((reset_reason & RCC_CSR_SFTRSTF) != 0U) {
        uart_text("SYS_RESET_KIND SOFTWARE\r\nSYS_SOFTWARE_RESET_OK\r\n");
    } else {
        uart_text("SYS_RESET_KIND POWER_OR_PIN\r\nSYS_SOFTWARE_RESET_REQUEST\r\n");
        HAL_Delay(10U);
        (void)xy_sys_reset(1);
        fail();
    }
    metadata_backend = pandora_fota_metadata_backend();
    if (xy_fota_metadata_flash_validate(metadata_backend) != XY_FOTA_OK) {
        fail();
    }
    if (xy_fota_metadata_flash_load(metadata_backend, &loaded) == XY_FOTA_NO_IMAGE) {
        if (xy_fota_metadata_flash_commit(metadata_backend, &metadata, &committed) != XY_FOTA_OK ||
            xy_fota_metadata_flash_load(metadata_backend, &loaded) != XY_FOTA_OK ||
            loaded.generation != committed.generation || loaded.active_version != 1U ||
            loaded.active_slot != 0U) {
            fail();
        }
    } else if (xy_fota_metadata_flash_load(metadata_backend, &loaded) != XY_FOTA_OK ||
               loaded.active_version != 1U || loaded.active_slot != 0U) {
        fail();
    }
    uart_text("FOTA_METADATA_FLASH_OK\r\n");
    if (xy_i2c_device_init(&aht10, pandora_soft_i2c_init(), 0x38U, 100U) != XY_DEVICE_OK) {
        fail();
    }
    int aht_initialized = aht10_init(&aht10);
    for (;;) {
        HAL_GPIO_TogglePin(GPIOE, GPIO_PIN_7);
        HAL_UART_Transmit(&uart1, (uint8_t *)banner, sizeof(banner) - 1U, 100U);
        HAL_UART_Transmit(&uart1, (uint8_t *)firmware_commit, sizeof(firmware_commit) - 1U, 100U);
        if (aht_initialized &&
            aht10_measure(&aht10, &humidity_milli_percent, &temperature_milli_c)) {
            HAL_UART_Transmit(&uart1, (uint8_t *)aht_ack, sizeof(aht_ack) - 1U, 100U);
            uart_text("AHT10 RH_milli_percent=");
            uart_u32(humidity_milli_percent);
            uart_text(" T_milli_c=");
            uart_i32(temperature_milli_c);
            uart_text("\r\n");
        } else {
            HAL_UART_Transmit(&uart1, (uint8_t *)aht_nack, sizeof(aht_nack) - 1U, 100U);
            aht_initialized = aht10_init(&aht10);
        }
        if (HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_10) == GPIO_PIN_RESET) {
            HAL_UART_Transmit(&uart1, (uint8_t *)key0, sizeof(key0) - 1U, 100U);
        }
        HAL_Delay(500U);
    }
}
